Fixes/src/Documents/СборкаЗапасов/СборкаЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c72244b0-b8b3-463a-867c-026ff64973b4">
  <name>СборкаЗапасов</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Document>

Fixes/src/Enums/ВидыОперацийСборкаЗапасов/ВидыОперацийСборкаЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="049da0b1-66e9-456d-94fb-81a331681584">
  <name>ВидыОперацийСборкаЗапасов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="68bbb161-df6f-4fc6-9a9d-929dbfe16377">
    <name>Сборка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b4c6416d-eee9-4fa0-a58f-44c311be61d9">
    <name>Разборка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Fixes/src/Documents/СборкаЗапасов/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура AzRyFix_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
		
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
	ЭтотОбъект.ОснованиеСоздания = Параметры.Основание;
	
	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация);
	
	Элементы.ЗаказПокупателя.ТолькоПросмотр = ЗначениеЗаполнено(Объект.ЗаказНаПроизводство);
	Элементы.ДокументОснованиеНадпись.Видимость = НЕ ПолучитьФункциональнуюОпцию("РезервированиеЗапасов");
	
	ИменаТЧ = Новый Массив;
	ИменаТЧ.Добавить(Новый Структура("ИмяПоляПроверки, ИмяПоляОформления", "Объект.Продукция.СтранаПроисхождения", "ПродукцияНомерГТД"));
	ИменаТЧ.Добавить(Новый Структура("ИмяПоляПроверки, ИмяПоляОформления", "Объект.Запасы.СтранаПроисхождения", "ЗапасыНомерГТД"));
	
	ГрузовыеТаможенныеДекларацииСервер.ПриСозданииНаСервере(ЭтаФорма, ИменаТЧ, КэшЗначений);
	КэшЗначений.Вставить("ВОРазборка", Перечисления.ВидыОперацийСборкаЗапасов.Разборка);
	КэшЗначений.Вставить("ВОСборка", Перечисления.ВидыОперацийСборкаЗапасов.Сборка);
	
	//ПодольскийАИ #УчетПроектов 13.10.2020 {
	КэшЗначений.Вставить("ПустойПроект", Справочники.Проекты.ПустаяСсылка());
	//ПодольскийАИ #УчетПроектов 13.10.2020 }
	
	УстановитьВидимостьИДоступность();
	УстановитьРежимИСписокВыбора();
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере(Метаданные.Документы.СборкаЗапасов.ТабличныеЧасти.Запасы, НастройкиЗагрузкиДанных, ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	// ПодключаемоеОборудование.
	ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	СписокЭлектронныхВесов = МенеджерОборудованияВызовСервера.ПолучитьСписокОборудования("ЭлектронныеВесы", , МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента());
	Если СписокЭлектронныхВесов.Количество() = 0 Тогда
		// Нет подключенных весов.
		Элементы.ЗапасыПолучитьВес.Видимость = Ложь;
	КонецЕсли;
	Элементы.ЗапасыЗагрузитьДанныеИзТСД.Видимость = ИспользоватьПодключаемоеОборудование;
	// Конец ПодключаемоеОборудование
	
	УстановитьВидимостьИДоступностьМобильноеПриложение();
	
	// КопированиеСтрокТабличныхЧастей
	КопированиеТабличнойЧастиСервер.ПриСозданииНаСевере(Элементы, "Продукция");
	КопированиеТабличнойЧастиСервер.ПриСозданииНаСевере(Элементы, "Запасы");
	КопированиеТабличнойЧастиСервер.ПриСозданииНаСевере(Элементы, "Отходы");
	
	// Серийные номера
	ИспользоватьСерийныеНомераОстатки = РаботаССерийнымиНомерами.ИспользоватьСерийныеНомераОстатки();
	//++Lazare 13.12.2021
	ЗапретРедактирования = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки("ЗапретРедактированияПроведенныхДокументовСборкаЗапасов");//Lazare-04.11.2021

	Если Объект.Ссылка.Пустая() Тогда
		Объект.ОснованиеПроизводство = Неопределено;
	Иначе            //Lazare-04.11.2021
		Если Объект.Проведен Тогда     
			ТолькоПросмотр = ЗапретРедактирования;
		КонецЕсли;   //Lazare-04.11.2021	
	КонецЕсли;//Паганини
	ОбщегоНазначенияПереопределяемый.УстановитьДополнительноеПоведениеСтандартныхКнопокТЧЗапасы(ЭтаФорма);// Kuzmich, 07.08.2019, Дополнительные инструменты в табличных частях документов движения товаров
	
	ДополнительныеПараметры = УправлениеСвойствамиПереопределяемый.ЗаполнитьДополнительныеПараметры(Объект, "ДополнительныеРеквизиты", , "КомандыОбычные");
	
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	
	УстановитьВидимостьКнопкиПроизводства(); //+++ Дмгг
	
	// ЗагрузкаДанныхИзВнешнегоИсточника
	//Lazare_
	ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере(Метаданные.Документы.СборкаЗапасов.ТабличныеЧасти.Запасы, НастройкиЗагрузкиДанных, ЭтотОбъект);
	
	Элементы.ТыпОперации.Видимость = Константы.ПроизводственныеПотери.Получить() и Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСборкаЗапасов.Сборка");
	//_Lazare
	//--------------------------------------------------------------------------
	// © Шишка В.В. [23 декабря 2023]  НАЧАЛО
	УчитыватьДополнительныеЗатратыВПроизводстве = ПолучитьФункциональнуюОпцию("УчитыватьДополнительныеЗатратыВПроизводстве");	
	// © Шишка В.В. [23 декабря 2023]  КОНЕЦ
	//--------------------------------------------------------------------------
	
	
	ФункционалСобраниеЗапасовВДокументе = РегистрыСведений.УчетнаяПолитикаРегл.ЗначениеПоляУчетнойПолитики("СобраниеЗапасовВДокументеСборкаЗапасов", Объект.Организация);
	Элементы.ЗапасыКоличествоСобр.Видимость = ФункционалСобраниеЗапасовВДокументе;  
	
	//+++ Дмгг, ONESOFT-2638
	ВалютаРасчетов = Справочники.Валюты.НайтиПоНаименованию("GEL");    
	УчетВалютныхОпераций = Константы.ФункциональнаяУчетВалютныхОпераций.Получить();  
	УчетВалютныхОпераций = Константы.ФункциональнаяУчетВалютныхОпераций.Получить();
	СтруктураНадписи = Новый Структура("ВалютаДокумента, ВалютаРасчетов, Курс, КурсНациональнаяВалюта, СуммаВключаетНДС, УчетВалютныхОпераций, ВидЦенКонтрагента, НалогообложениеНДС,ВидЦен", Объект.ВалютаДокумента, ВалютаРасчетов, Объект.Курс, 1, Объект.СуммаВключаетНДС, УчетВалютныхОпераций, ВидЦенКонтрагента, Объект.НалогообложениеНДС, ВидЦен);
	ЦеныИВалюта = СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
	//--- Дмгг, ONESOFT-2638     
	
	ФункционалИзменитьЛогикуСобранияЗапасов = РегистрыСведений.УчетнаяПолитикаРегл.ЗначениеПоляУчетнойПолитики("ИзменитьЛогикуСобранияЗапасов", Объект.Организация);
	
	//ONESOFT-3694
	//Элементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы.ФормаДокументЧекККМСоздатьНаОсновании.видимость = Константы.СозданиеДокументаЧекКкмНаОснованииДокументаСборкаЗапасов.Получить(); 	
	
КонецПроцедуры
